{"title":"Daisuke Murase","date":"","tags":null,"eid":null,"image":null,"content":"\n<h3>Contact Information</h3>\n<ul>\n<li>Portland OR</li>\n<li>(503) 568-1596</li>\n<li>typester@gmail.com</li>\n</ul>\n\n<h3>Summary</h3>\n<p>Highly skilled and experienced software engineer with over 20 years of expertise in developing scalable, high-performance software solutions. Specializes in Rust, TypeScript, and mobile development, with a proven track record in leadership roles and startup environments. Particularly adept at building asynchronous network applications, backend systems, and mobile app core logic using Rust.</p>\n\n<h3>Skills</h3>\n<ul>\n<li><strong>Programming Languages:</strong> Rust, TypeScript, Perl, C</li>\n<li><strong>Frameworks &amp; Libraries:</strong> tokio (Rust), sqlx (Rust), axum (Rust), React/ReactNative, Next.js, Jetpack Compose</li>\n<li><strong>Tools &amp; Technologies:</strong> Docker, Git, SQL, UniFFI, REST API, GraphQL, Redis, Firestore</li>\n<li><strong>Cloud &amp; DevOps:</strong> AWS, GCP, Firebase, CI/CD pipelines, Kubernetes</li>\n<li><strong>Mobile Development:</strong> Android (Jetpack Compose), iOS (SwiftUI), ReactNative, Rust</li>\n<li><strong>Soft Skills:</strong> Leadership, Team Collaboration, Agile Methodologies, Problem Solving</li>\n</ul>\n\n<h3>Professional Experiences</h3>\n<h4>Lead Software Engineer at HOMMA Inc.</h4>\n<p>April 2020 - October 2024</p>\n<p>Mobile app architectural design and implementation, taking it from scratch to release using ReactNative. Later joined the Hub team (smart home computer) working in Rust to focus on performance improvements, maintenance, and the design and implementation of new Hub services.</p>\n<p>Archievements:</p>\n<ul>\n<li>Developed and released a mobile app from scratch using ReactNative.</li>\n<li>Migrated the Hub system from a Node.js-based solution to Rust, significantly improving performance and memory efficiency.</li>\n</ul>\n\n\n\n<h4>Software Engineer at Glasp Inc.</h4>\n<p>April 2023 - October 2023</p>\n<p>Led efforts to refactor and clean up the existing codebase, as well as spearheaded the development of a mobile app from scratch to release.</p>\n<p>Achievements:</p>\n<ul>\n<li>Designed and built a GraphQL version of the API using Rust.</li>\n<li>Developed a mobile app from scratch, with core logic written in Rust and UI implemented natively using Jetpack Compose for Android and SwiftUI for iOS.</li>\n</ul>\n\n\n<h4>Chief Technology Officer at Nature Inc. (Japan)</h4>\n<p>April 2018 - Auguest 2019,\nSeptember 2019 - March 2020 (Contractor)</p>\n<p>As CTO, made all technology decisions, designed and architected the entire company's technical solutions, including backend systems, mobile apps, and device firmware.</p>\n<p>Archivements:</p>\n<ul>\n<li>Rewrote and released the existing mobile app using ReactNative.</li>\n<li>Designed and developed firmware in C for new ESP32 based hardware from scratch, including obtaining certification for echonet-lite (a communication protocol for smart home devices in Japan).</li>\n</ul>\n\n\n<h4>Founder &amp; CTO at Make It Real Inc. (Japan)</h4>\n<p>September 2014 - March 2018</p>\n<p>Developed experimental MVPs for client companies upon request, specializing in rapid prototyping. Notable projects included building the communication feature for a walkie-talkie app and the communication component for a robot conference system.</p>\n\n<h4>Lead Software Engineer at KAYAC Inc. (Japan)</h4>\n<p>September 2004 - July 2014</p>\n<p>As part of the R&amp;D team for new business development, designed and implemented the architecture for various services and libraries, including a VoIP calling app, an online voice sharing service, and an open-source RTMP server.</p>\n\n<h3>Advisory Roles</h3>\n<h4>Zypsy Inc.</h4>\n<ul>\n<li><strong>Role:</strong> Technical Advisor</li>\n<li><strong>Duration:</strong> July 2018 - August 2018</li>\n</ul>\n\n<h4>Wellstyle Corporation (Japan)</h4>\n<ul>\n<li><strong>Role:</strong> Technical Advisor</li>\n<li><strong>Duration:</strong> March 2014 - July 2019</li>\n</ul>\n\n<h4>iichi Inc. (Japan)</h4>\n<ul>\n<li><strong>Role:</strong> Technical Advisor</li>\n<li><strong>Duration:</strong> September 2014 - March 2016</li>\n</ul>\n"}
